In [78]:
import pandas as pd

In [79]:
anna = pd.read_csv('./archive/annapurna-I.csv')

anna

              Date                 Name     Nationality         Cause of death
0       3 May 2019         Wui Kin Chin        Malaysia  Hypothermia/Frostbite
1    24 March 2015      Samuli Mansikka         Finland                   Fall
2    24 March 2015         Pemba Sherpa           Nepal                   Fall
3   7 October 2012         Ivan Lobanov      Uzbekistan              Avalanche
4   7 October 2012   Iljas Tukhvatullin      Uzbekistan              Avalanche
..             ...                  ...             ...                    ...
68     18 May 1973  Sadatoshi Takahashi           Japan              Avalanche
69     18 May 1973        Masanori Hama           Japan              Avalanche
70     18 May 1973      Kazumi Katagiri           Japan              Avalanche
71     18 May 1973                Rinje           Nepal              Avalanche
72     30 May 1970           Ian Clough  United Kingdom             Serac fall

[73 rows x 4 columns]

In [80]:
anna.isnull().any()

Date              False
Name              False
Nationality       False
Cause of death    False
dtype: bool

In [81]:
anna['top_id'] = 1

In [82]:
bro = pd.read_csv('./archive/broad-peak.csv')
bro['top_id'] = 2

In [83]:
cho = pd.read_csv('./archive/cho-oyu.csv')
cho['top_id'] = 3

In [84]:
dha = pd.read_csv('./archive/dhaulagiri-I.csv')
dha['top_id'] = 4

In [85]:
eve = pd.read_csv('./archive/everest.csv')
eve['top_id'] = 5

In [86]:
gasi = pd.read_csv('./archive/gasherbrum-I.csv')
gasi['top_id'] = 6

In [87]:
gasii = pd.read_csv('./archive/gasherbrum-II.csv')
gasii['top_id'] = 7

In [88]:
k2 = pd.read_csv('./archive/k2.csv')
k2['top_id'] = 8

In [89]:
kan = pd.read_csv('./archive/kangchenjunga.csv')
kan['top_id'] = 9

In [90]:
ion = pd.read_csv('./archive/lhotse.csv')
ion['top_id'] = 10

In [91]:
deads_table = [anna, bro, cho, dha, eve, gasi, gasii, k2, kan, ion, mak, man, nan, shi]
deads = pd.concat(deads_table).reset_index()
deads

,index,Date,Name,Nationality,Cause of death,top_id
0,0,3 May 2019,Wui Kin Chin,Malaysia,Hypothermia/Frostbite,1
1,1,24 March 2015,Samuli Mansikka,Finland,Fall,1
2,2,24 March 2015,Pemba Sherpa,Nepal,Fall,1
3,3,7 October 2012,Ivan Lobanov,Uzbekistan,Avalanche,1
4,4,7 October 2012,Iljas Tukhvatullin,Uzbekistan,Avalanche,1
...,...,...,...,...,...,...
1028,26,22 May 1991,Günther Semmler,Germany,Disappearance (probably avalanche),14
1029,27,22 May 1991,Karl-Heinz Thiele,Germany,Disappearance (probably avalanche),14
1030,28,15 October 1990,Joan Martinez,Spain,Exposure,14
1031,29,4 October 1989,Luca Leonardi,Switzerland,Avalanche,14
1032,30,28 April 1983,Fritz Luchsinger,Switzerland,Altitude sickness,14

In [92]:
import re

In [93]:
year = []

for elem in deads['Date']:
    years = re.search(r"\d{4}$", elem)
    if years:
        year.append(years.group())
    elif re.search(r"\d{4}", elem):
        year.append(re.search(r"\d{4}", elem))
    else:
        year.append('')

# year

In [94]:
deads.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1033 entries, 0 to 1032
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   index           1033 non-null   int64
 1   Date            1033 non-null   object
 2   Name            1033 non-null   object
 3   Nationality     1033 non-null   object
 4   Cause of death  1033 non-null   object
 5   top_id          1033 non-null   int64
dtypes: int64(2), object(4)
memory usage: 48.6+ KB

In [95]:
deads['Year'] = year

In [96]:
deads[deads['Year'] == ''].value_counts()

Series([], Name: count, dtype: int64)

In [98]:
deads['Date'].value_counts()

Date
14 / 15 June 1937    16
April 25, 2015       16
April 18, 2014       15
10 April 1972        15
22 June 2013         11
                     ..
May 20, 2000          1
May 21, 2000          1
April 29, 2001        1
May 23, 2001          1
28 April 1983         1
Name: count, Length: 670, dtype: int64

In [99]:
from datetime import datetime

In [100]:
# fechas = [datetime.strptime(fecha_str, "%d %B %Y") for fecha_str in deads['Date']]
# meses = [fecha.strftime("%B") for fecha in fechas]
# meses

In [101]:
from dateutil.parser import parse

In [129]:
deads.loc[deads['Date'] == 'Winter 1999', 'Date'] = 'feb 1999'
deads.loc[deads['Date'] == 'Summer 1990', 'Date'] = 'jul 1999'
deads.loc[deads['Date'] == 'May 31, 1934[note 2]', 'Date'] = 'May 31, 1934'
deads.loc[deads['Date'] == '9–10 June 1977', 'Date'] = '9 June 1977'
deads.loc[deads['Date'] == 'mid July 1982', 'Date'] = 'July 1982'
deads.loc[deads['Date'] == 'late June 1975', 'Date'] = 'June 1975'
deads.loc[deads['Date'] == '19 May 1996 or May 1997', 'Date'] = '19 May 1996'

In [121]:
deads[deads['Date'] == 'May 31, 1934[note 2]'].value_counts()

Series([], Name: count, dtype: int64)

In [132]:
fechas = [parse(fecha_str) for fecha_str in deads['Date']]
meses = [fecha.month for fecha in fechas]
deads['Month'] = meses
deads['Month'].value_counts()

Month
5     307
10    143
4     137
7     125
9     115
6      78
8      66
12     23
3      18
2      10
1      10
11      1
Name: count, dtype: int64

In [136]:
# deads['Cause of death'].value_counts()

In [138]:
deads.to_csv('deads.csv')

In [139]:
top = pd.read_csv('./archive/tops.txt')
top

    id           Name   Latitude  Longitude  Altitude
0    1      Annapurna  28.583300  83.950000      8091
1    2     Broad Peak  35.814270  76.566110      8051
2    3        Cho Oyu  28.096750  86.659630      8188
3    4     Dhaulagiri  28.697609  83.489488      8167
4    5        Everest  27.987850  86.925026      8849
5    6   Gasherbrum I  35.724430  76.696410      8080
6    7  Gasherbrum II  35.758331  76.653336      8035
7    8             K2  35.883333  76.513340      8611
8    9  Kangchenjunga  27.703140  88.147390      8586
9   10         Ihotse  27.966667  86.933333      8516
10  11         Makalu  27.889880  87.089440      8481
11  12        Manaslu  28.549980  84.559730      8163
12  13   Nanga Parbat  31.650500 -21.788590      8126
13  14   Shishapangma  28.352246  85.779566      8027